# ------------------------------------------------------------------------
# сравнение двух переменных
# ------------------------------------------------------------------------

# программа должна иметь две функции input()
# они записывают данные (присваивают) в переменные data1 и data2
# создать переменную result и присвоить ей пустую строку

# сравнить переменные (data1 и data2) - используя if, elif и else условие

# если переменные data1 и data2 равны то переписать (присвоить) переменной result предложение "переменные равны"
# (в переменные можно записывать предложения)
# если переменная data1 больше чем data2 то переписать (присвоить) переменной result предложение "первая переменная больше" 
# если переменная data1 меньше чем data2 то переписать (присвоить) переменной result предложение "первая переменная меньше"

# вывести на экран содержимое перемнной result использую функцию print()