# ------------------------------------------------------------------------
# выступаю в роли ЗАКАЗЧИКА
# добавить новый функционал к игре крестики-нолики
# 1) добавить механизм выбора "o" или "x". визуально можно сделать любой вариант.
# главный смысл чтобы игрок мог выбрать какой знак использовать
# 2) в конце игры добавить показ окна с результатом игры и кнопками "начать снова" и "закрыть".
# при клике на "начать снова" нужно стартовать игру сначала
# 3) добавить кнопку "ход назад". при клике откатывать игру к предыдущему хода.
# эта кнопка должна добавить возможность вернуться к старту игры - прокликав все ходы назад
# ------------------------------------------------------------------------