# ------------------------------------------------------------------------
# https://www.youtube.com/watch?v=j8Dm8ORobTc&ab_channel=%D0%98%D0%B7%D1%83%D1%87%D0%B0%D0%B5%D0%BC%D0%BC%D0%B8%D1%80%D0%98%D0%A2%2F%D0%9E%D0%BB%D0%B5%D0%B3%D0%A8%D0%BF%D0%B0%D0%B3%D0%B8%D0%BD%2FWISEPLAT
# смотреть и делать до 15 минуты!!!!
# такие уроки я обычно делаю так:
# вижу что-то новое - останавливаю видео, повторяю у себя
# может еще гуглю это чтобы лучше понять
# 
# 
# в это файл нужно записать что он делает у себя и прислать мне
# ------------------------------------------------------------------------