# ------------------------------------------------------------------------
# похоже на задание test5.py только нужно использовать несколько elif
# ------------------------------------------------------------------------


# программа должна иметь две функции input()
# они записывают данные (присваивают) в переменные data1 и data2
# создать переменную result и присвоить ей пустую строку

# сравнить переменные (data1 и data2) - используя if, elif (несколько) и else условие

# если переменные data1 и data2 равны числу 333 то переписать (присвоить) переменной result предложение "переменные равны числу 333"
# если переменные data1 и data2 равны числу 500 то переписать (присвоить) переменной result предложение "переменные равны числу 500"
# если переменные data1 и data2 равны числу 999 то переписать (присвоить) переменной result предложение "переменные равны числу 999"
# если одна из переменных (data1 или data2) равна числу 333 то переписать (присвоить) переменной result предложение "одна из переменных равна числу 333"
# если одна из переменных (data1 или data2) равна числу 500 то переписать (присвоить) переменной result предложение "одна из переменных равна числу 500"
# если одна из переменных (data1 или data2) равна числу 999 то переписать (присвоить) переменной result предложение "одна из переменных равна числу 999"

# вывести на экран содержимое перемнной result использую функцию print()