# ------------------------------------------------------------------------
# ООП стиль и разделение на файлы (опредениени класса и выполнение) 
# Создать скрипт который будет выводить список директорий и файлов 
# в текущей директории и директории родителя.
# Сначала нужно выводить директории (родителя) + подписать директорию(заменить имя) где скрипт(iamhere), директории(текущей), файлы(родителя), файлы(текущей).
# Таже выводить нужно размер в гигабайтах
# ------------------------------------------------------------------------