# ------------------------------------------------------------------------
# 0) ООП стиль и разделение на файлы (опредениени класса и выполнение) 
# 1) цены из этого файла увеличить на 13% https://people.sc.fsu.edu/~jburkardt/data/csv/ford_escort.csv
# 2) преобразовать и записать данные в json формате
# 3) матерал для изучение https://www.youtube.com/watch?v=94fHz4w65PY&ab_channel=%D0%92%D0%B5%D0%B1-%D0%BF%D1%80%D0%BE%D0%B3%D1%80%D0%B0%D0%BC%D0%BC%D0%B8%D1%81%D1%82.%D0%94%D0%BC%D0%B8%D1%82%D1%80%D0%B8%D0%B9%D0%A7%D0%B5%D0%BD%D0%B3%D0%B0%D0%B5%D0%B2.
# ------------------------------------------------------------------------