# ------------------------------------------------------------------------
# задание на использование логических операторов "and" и "or" в if условиях
# то что изучал в Бердянске
# ------------------------------------------------------------------------


# программа должна иметь две функции input()
# они записывают данные (присваивают) в переменные data1 и data2
# создать переменную result и присвоить ей пустую строку

# сравнить переменные (data1 и data2) - используя if, elif и else условие

# если обе переменные data1 и data2 равны числу 666 то переписать (присвоить) переменной result предложение "переменные равны числу 666"
# если одна из переменных (data1 или data2) равна числу 666 то переписать (присвоить) переменной result предложение "одна из переменных равна числу 666" 
# если ни одна из переменных переменная (data1, data2) не равна числу 666 то переписать (присвоить) переменной result предложение "ни одна из переменных не равна числу 666" 

# вывести на экран содержимое переменной result используя функцию print()