# ------------------------------------------------------------------------
# 0) ООП стиль и разделение на файлы (опредениени класса и выполнение) 
# 1) по данным с https://people.sc.fsu.edu/~jburkardt/data/csv/homes.csv
# 2) создать класс Home со свойствами - которее совпадают с колонками из файла
# 3) Создать  класс Factory который будет читать этот файл и создавать обьекты класса Home
# 4) где в свойствах буду записагные данные из этих колонок
# 5) у класса Factory должен быть метод с возвратом всех обьектов в списке
# 6) также должен быть метод для вставки одиночных обьектов класса Home
# 7) создать класс Stats которые принимает список из обьектов класса Home
# 8) у этого класса должен быть метод которые принимает список с стрингов (название колонок)
# 9) и должен генерить csv файл на основание списка обьектов класса Home и с названием тех колонок которые переданы
# ------------------------------------------------------------------------