# ------------------------------------------------------------------------
# установить консольную прогрвмму git
# скачать программу https://github.com/hamoid/ableton-live-preset-report
# используй (в консоли)
# пример команды    git clone https://github.com/hamoid/ableton-live-preset-report.git
# запустить программу - проверить работоспособность
# добавить в программу код, который записывает результат в csv файлы
# в формате  - название файла источника - название файла результат
# в файлах данные по колонках
# ------------------------------------------------------------------------