# ------------------------------------------------------------------------
# сравнение переменной используя if и len функцию
# пример         if len(data) > 8:
# ------------------------------------------------------------------------

# программа должна иметь одну функцию input()
# она записывает данные (присваивает) в переменную data
# создать переменную result и присвоить ей пустую строку

# если длина переменной data равна 6 то переписать (присвоить) переменной result предложение "длина 6"
# если длина переменной data равна 3 то переписать (присвоить) переменной result предложение "длина 3"

# вывести на экран содержимое перемнной result использую функцию print()